# 01. Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import os

# 02. Importing Data

In [2]:
# creating path to data folders
path = r'C:\Users\mngun\Documents\11_2023_InstaCart_asket_Analysis'

In [3]:
# import products data
df_prods = pd.read_csv(os.path.join(path,'02_Data','Original Data','products.csv'),index_col = False)

In [4]:
# import orders data
df_ords = pd.read_csv(os.path.join(path,'02_Data','Prepared Data','orders_wrangled.csv'),index_col = False)

# 03. Debugging

In [5]:
# get summary statististics of the df_ords dataframe
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [6]:
# removing the additional index column (unnamed: 0)
df_ords = df_ords.drop(columns = ['Unnamed: 0'])

In [7]:
# creating test dataframe
df_test = pd.DataFrame()

In [9]:
# create a mixed type column
df_test['mix'] = ['a','b',1, True]

In [10]:
df_test.head(20)

    mix
0     a
1     b
2     1
3  True

In [11]:
# check for mixed type data (Prescribed method is deprecated - outdated)
for col in df_test.columns.tolist():
    weird = (df_test[col].map(type) != df_test[col].iloc[0].__class__)
    if len(df_test[weird]) > 0:
        print(col)

mix

In [8]:
# checking for missing values in df_prods
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [9]:
# creating dataframe for rows with missing values 
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [10]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [11]:
df_prods.shape

(49693, 5)

In [12]:
# create a dataframe without missing values in product_name column
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [13]:
df_prods_clean.shape

(49677, 5)

# 04. Looking for Duplicates

In [14]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [15]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [16]:
# remove duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [17]:
# see rows and columns in df_prods_clean_no_dups dataframe
df_prods_clean_no_dups.shape

(49672, 5)

In [21]:
# exporting dataframe
df_prods_clean_no_dups.to_csv(os.path.join(path,'02_Data','Prepared Data','df_prods_checked'))

# Answers Excercise 4.5

Question 2

In [18]:
# inspecting the df_ords dataframe
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

Notes to the df_ords dataframe
- The first column(unnamed) is another index column. It needs to be deleted.
- The count for 'days_since_prior_order' is less than all other columns

Question 3

In [19]:
# checking for mixed types in df_ords (Previously prescribed code is deprecated - outdated)
for col in df_ords.columns.tolist():
    if len(df_ords[col].apply(type).unique()) > 1:
        print(col + ' has mixed datatype')
    else:
        print(col + ' no mixed datatype')

order_id no mixed datatype
user_id no mixed datatype
order_number no mixed datatype
orders_day_of_week no mixed datatype
order_hour_of_day no mixed datatype
days_since_prior_order no mixed datatype

- The above columns have been identified as having mixed type data (edit: the code was changed and there no mixed types)

Question 4

In [20]:
# a. Investigate unique types in identified columns
for col in ['order_id', 'user_id', 'order_number', 'orders_day_of_week', 'order_hour_of_day', 'days_since_prior_order']:
    unique_types = df_ords[col].apply(type).unique()
    print(f"{col}: {unique_types}")

order_id: [<class 'int'>]
user_id: [<class 'int'>]
order_number: [<class 'int'>]
orders_day_of_week: [<class 'int'>]
order_hour_of_day: [<class 'int'>]
days_since_prior_order: [<class 'float'>]

Question 5

In [21]:
# Investigating the missing values in the columns
df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

- the missing values are recorded as Nan

In [22]:
# creating a dataframe from the missing values in 'days_since_prior_order'
df_nan_ords = df_ords[df_ords['days_since_prior_order'].isnull() == True]

- The NaN values represent the first orders of a user/client, therefore there can be no prior orders to compare with.

Question 6

In [23]:
# change df name and create a new column with boolean value, to flag missing values in 'days_since_prior_orders' column
df_ords_clean = df_ords
df_ords_clean['first_purchase'] = df_ords['days_since_prior_order'].isnull() == True
df_ords_clean

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_purchase
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False
...,...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0,False
3421079,1854736,206209,11,4,10,30.0,False
3421080,626363,206209,12,1,12,18.0,False
3421081,2977660,206209,13,1,12,7.0,False
3421082,272231,206209,14,6,14,30.0,False

The column with missing values will not be edited, because it provides useful information for first purchases. Instead another column is added, which will return a boolean value of True or False, if the purchase, is a first time purchase.
Removing the rows would not make sense.

Question 7

In [24]:
# creating a dataframe for al duplicated values/rows
df_ords_dups = df_ords_clean[df_ords_clean.duplicated()]

In [25]:
df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, first_purchase]
Index: []

These duplicates maybe due to manual processing error, or a system error in capturing the transactions.

In [26]:
#removing duplicates from the dataframe
df_ords_checked = df_ords_clean.drop_duplicates()

In [28]:
df_ords_checked.shape

(3421083, 7)

I chose to remove the duplicates, because they would result in a distorted analysis.

In [27]:
# checking that the duplicates were removed
df_dups_2 = df_ords_checked[df_ords_checked.duplicated()]
df_dups_2

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, first_purchase]
Index: []

# Export the cleaned and checked dataframes to csv

In [36]:
df_ords_checked.to_csv(os.path.join(path,'02_Data','Prepared Data','df_ords_checked.csv'))

In [37]:
df_prods_clean_no_dups.to_csv(os.path.join(path,'02_Data','Prepared Data','df_prods_checked.csv'),index=False)

In [35]:
df_ords_checked.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_purchase
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False